{
  "main": {
    "name":"Alex",
    "fullname":"Alex Catalan",
    "occupation":"Software Engineer",
    "description":"-----",
    "image":"profilepic.jpg",
    "bio":"<p>Soy graduado en informática, especializado en ingeniería del software. Soy desarrollador junior, con experiencia en frontend y backend. Tengo especial entusiasmo en patrones de diseño y calidad del código.</p><p>He participado en varias Hackathons, me encanta aprender del resto, trabajar en equipo y superar retos</p><p>Me considero una persona ambiciosa y con muchas ganas de seguir aprendiendo",
    "email": "",
    "address":{
      "city":"Barcelona",
      "zip": "08840"
    },
    "website": "http://alexcatmu.site",
    "resumedownload":"http://alexcatmu.site/resumeCV",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/alex-catalan-munoz",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/alexcatmu",
        "className":"fa fa-github"
      }
    ],
    "visible": {
      "home": true,
      "about": true,
      "resume": true,
      "contact": false
    }
  },
  "resume":{
    "education":[
      {
        "school":"Universitat Politècnica de Catalunya",
        "degree":"Ingeniería del Software",
        "graduated":"Septiembre 2017 - Junio 2021",
        "description":[
          "Especificación, diseño, implementación, despliegue y evaluación de productos",
          "Procedimientos y complejidad algorítmica para el diseño de soluciones",
          "Funcionamiento interno de un computador",
          "Desarrollar, mantener y evaluar servicios y sistemas software que satisfagan los requisitos del usuario",
          "Espeficicar los requisitos del software en funcion de las necesidades del cliente"
        ]
      },
      {
        "school":"IES Calamot",
        "degree":"DAM (Desarrollo de Aplicaciones Multiplataforma)",
        "graduated":"Septiembre 2015 - Enero 2017",
        "description":[
          "Gestión de Bases de Datos",
          "Desarrollo de interfaces gráficas de usuario interactivas",
          "Desarrollo de aplicaciones móviles",
          "Desarrollo de aplicaciones multiproceso"
        ]
      }
    ],
    "work":[
      {
        "company":"Inlab FIB",
        "title":"Full Stack developer",
        "years":"Octubre 2018 - Present",
        "description":[
          "WEB para visualizar, comparar y clasificar resultados de ensayos de microbiología",
          "Frontend y backend para la visualización de modelos de simulación. Desarrollado con PostgreSQL, Spring y Angular",
          "Aplicación móvil multiplataforma (IONIC). Notifica a los usuarios de posibles catástrofes naturales y las acciones que se deben tomar",
          "Interfaz WEB desarrollada en React. Automatización de procesos, alarmas y protocolos de actuación de los datos que se reciben de distintos sensores"
        ]
      },
      {
        "company":"BSC (Barcelona Supercomputing Center)",
        "title":"Full Stack developer",
        "years":"April 2018 - October 2018",
        "description":[
          "Desarrollo de una aplicacion móvil multiplataforma desarrollada en IONIC"
        ]
      },
      {
        "company":"Clickedu",
        "title":"Full Stack developer",
        "years":"April 2016 - April 2018",
        "description":[
          "Resolución de incidencias en la WEB. UX, backend, frontend y estilos",
          "Nuevas funcionalidades y módulos en la web",
          "Automatización de procesos e implementación de Tests en la plataforma"
        ]
      }
    ],
    "skills":[
      {
        "name":"Angular",
        "description":"Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image":"angular.png"
      },
      {
        "name":"Ionic",
        "description":"Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image":"ionic.png"
      },
      {
        "name":"Django",
        "description":"I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image":"django.png"
      },
      {
        "name":"Spring",
        "description":"I am fairly new to Remoact and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image":"spring.png"
      },
      {
        "name":"Others",
        "description":"React js, C++, PHP, SQL y NoSQL, GIT",
        "image":"others.png"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"",
        "category":"",
        "image":"",
        "url":""
      }
    ]
  }
}
